% Правая часть дифференциального уравенния

function dydt = odefun1(t, y)
    global k h;
    y_eq = [0, 0, 0];
    dydt = [y(4);
            y(5);
            y(6);
            -k(1)*(y(1)-y_eq(1)) + 4*h(1, 1)*((y(1)-y_eq(1))^3) + 2*h(1, 2)*(y(1)-y_eq(1))*((y(2)-y_eq(2))^2) + 2*h(1, 3)*(y(1)-y_eq(1))*((y(3)-y_eq(3))^2);
            -k(2)*(y(2)-y_eq(2)) + 4*h(2, 2)*((y(2)-y_eq(2))^3) + 2*h(2, 1)*(y(2)-y_eq(2))*((y(1)-y_eq(1))^2) + 2*h(2, 3)*(y(2)-y_eq(2))*((y(3)-y_eq(3))^2);
            -k(3)*(y(3)-y_eq(3)) + 4*h(3, 3)*((y(3)-y_eq(3))^3) + 2*h(3, 1)*(y(3)-y_eq(3))*((y(1)-y_eq(1))^2) + 2*h(3, 2)*(y(3)-y_eq(3))*((y(2)-y_eq(2))^2)];
end