%  Дифференциальные уравнения кинетики энергии

function dydt = odefun_kin(~, y, k)
    dydt = zeros(size(y));
    dydt(1) = 2 * y(1) * y(2) * (k(2) * y(2) - k(1) * (y(1)^2)) + y(1) * y(3) * (k(4) * (y(3)^2) - k(3) * y(1));  %  уравнения 6 степени
    dydt(2) = y(1) * y(2) * (k(1) * (y(1)^2) - k(2) * y(2)) + y(2) * y(3) * (k(6) * (y(3)^4) - k(5) * y(2));
    dydt(3) = 2 * y(1) * y(3) * (k(3) * y(1) - k(4) * (y(3)^2)) + 4 * y(2) * y(3) * (k(5) * y(2) - k(6) * (y(3)^4));
end

%{
dydt(1) = y(1) * y(2) * (k(2) * y(2) - k(1) * y(1)) + y(1) * y(3) * (k(4) * y(3) - k(3) * y(1));  %  уравнения 3 степени
dydt(2) = y(1) * y(2) * (k(1) * y(1) - k(2) * y(2)) + y(2) * y(3) * (k(6) * y(3) - k(5) * y(2));
dydt(3) = y(1) * y(3) * (k(3) * y(1) - k(4) * y(3)) + y(2) * y(3) * (k(5) * y(2) - k(6) * y(3));
%}

%{
dydt(1) = 2 * y(1) * y(2) * (k(2) * y(2) - k(1) * (y(1)^2)) + y(1) * y(3) * (k(4) * (y(3)^2) - k(3) * y(1));  %  уравнения 6 степени
dydt(2) = y(1) * y(2) * (k(1) * (y(1)^2) - k(2) * y(2)) + y(2) * y(3) * (k(6) * (y(3)^4) - k(5) * y(2));
dydt(3) = 2 * y(1) * y(3) * (k(3) * y(1) - k(4) * (y(3)^2)) + 4 * y(2) * y(3) * (k(5) * y(2) - k(6) * (y(3)^4));
%}